SweetSai.org
#+Title: SweetSai - a Sweet based web app dev effort for Semantic Style Sheets
#+Author: Sai Gollapudi
#+Email: saigollapudi1@gmail.com

* Introduction
Essentially we are trying to implement the notion of Semantic Style
Sheets. Style Sheets essentially provide alternate views to one
singular content. In our case we wish to provide alternate narratives
to one singular narrative. The alternative narratives may be more
meaningful to end users. This idea of a more meaningful narrative is
what we are calling semantic. So, a semantic style sheet is a
renarrating a existing page into something that has more meaning to an
enduser.

The renarration of a page to a more meaningful version is a type of
page transformation. We see the page transformation involving new set
of parameters
+ 'd' a data-structure (perhaps an ontology) to markup a page into a
  semantically meaningful setup. This is user-defined.
+ 'v' a data-structure (perhaps an ontology) to define the various
  communities to which viewer belongs to. This defines which view to
  show to a community of user.
+ 'r' this defines the renarration rules. This is also a
  data-structure (perhaps an ontology) which gives the various choices
  of renarration that are possible for a markup.


* Requirements
** overview of requirement
The overall aim is to develop a tool that would enable the following:
+ an editor environment
++ a user should be able to define a document structure (as an
 ontology). This we are calling as 'd' in our transformation function
+++ this ontology will initially be a simple data structure. Over time
 it will evolve into a more elaborate, user definable ontology.
++ a user should be able to import a web page by inputing a URL in the
 input text area
++ a user should be able to markup an input html doc with user defined tags (based on a user ontology, which we
  are calling 'd') 

+ a viewer environment 
++ a viewer where a user is allowed to see a marked-up file in a newly
renarrated manner
+++ for this to happen, the user is identified as part of a viewer
ontology called 'v'. Initially we will pre-define this ontology as a
simple data-structure. Over time this will evolve into a more
elaborate ontology that is user definable.
+++ there is also a rules for renarration 'r' that we will be using to
define how one must transform a marked-up content. This can be quite
elaborate. However, for the initial round, we will fix this to be a
simple structure and evolve it into a more complex ontology over time.


** roadmap of activity
This Semantic Style Sheet system will be developed in releases called
r0, r1, r2, r3... 

+ r0 - basic implementation of a python server, client side pages to
  input URLs, view web pages
+ r1 - ability to markup a web page, adding a simple 'd'
+ r2 - ability to persist the markup done in r1 (database)
+ r3 - ability to input 'v' and 'r'
+ etc.


** r0 - release 0 requirement
+ To develop a client server app using Python backend. 
+ The UI should be sufficient to take on a URL.
+ There should be an ability to view a userinput page.


To develop a SweetApp. Aim of the app would be able to manipulate
Sweets. By manipulation I mean that I should be able to create and
query sweets of my own making. They should be independent of any
specific Sweet App. 


