SweetSai.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SweetSai - a Sweet based web app dev effort for Semantic Style Sheets</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="SweetSai - a Sweet based web app dev effort for Semantic Style Sheets"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2016-03-02T15:05+0530"/>
<meta name="author" content="Sai Gollapudi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">SweetSai - a Sweet based web app dev effort for Semantic Style Sheets</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Introduction</a></li>
<li><a href="#sec-2">2 Requirements</a>
<ul>
<li><a href="#sec-2-1">2.1 overview of requirement</a></li>
<li><a href="#sec-2-2">2.2 roadmap of activity</a></li>
<li><a href="#sec-2-3">2.3 r0 - release 0 requirement</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Design</a>
<ul>
<li><a href="#sec-3-1">3.1 installation information</a></li>
<li><a href="#sec-3-2">3.2 execution information</a></li>
<li><a href="#sec-3-3">3.3 server side</a>
<ul>
<li><a href="#sec-3-3-1">3.3.1 CORS</a></li>
<li><a href="#sec-3-3-2">3.3.2 SWeet Store API</a></li>
</ul>
</li>
<li><a href="#sec-3-4">3.4 client side</a></li>
<li><a href="#sec-3-5">3.5 Software Engineering aspects</a></li>
</ul>
</li>
<li><a href="#sec-4">4 implementation</a>
<ul>
<li><a href="#sec-4-1">4.1 basic layout &amp; structure</a></li>
<li><a href="#sec-4-2">4.2 Editor</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1 model (database work)</a></li>
<li><a href="#sec-4-2-2">4.2.2 view</a></li>
<li><a href="#sec-4-2-3">4.2.3 my welcome page</a></li>
<li><a href="#sec-4-2-4">4.2.4 controller</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3 support infra</a>
<ul>
<li><a href="#sec-4-3-1">4.3.1 Config.py file</a></li>
<li><a href="#sec-4-3-2">4.3.2 _<sub>init</sub>__.py file</a></li>
<li><a href="#sec-4-3-3">4.3.3 Authentication of user</a></li>
<li><a href="#sec-4-3-4">4.3.4 Macro for rendering WTF forms</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-5">5 Installations</a></li>
<li><a href="#sec-6">6 Execution</a></li>
<li><a href="#sec-7">7 Server Side or Back-End Development work</a>
<ul>
<li><a href="#sec-7-1">7.1 Important code files</a></li>
<li><a href="#sec-7-2">7.2 SweetSai.py</a></li>
<li><a href="#sec-7-3">7.3 forms.py file</a></li>
<li><a href="#sec-7-4">7.4 my HTML files</a>
<ul>
<li><a href="#sec-7-4-1">7.4.1 core or base template</a></li>
<li><a href="#sec-7-4-2">7.4.2 navigation bar template</a></li>
<li><a href="#sec-7-4-3">7.4.3 how I intend to show sweets</a></li>
<li><a href="#sec-7-4-4">7.4.4 my page for getting Sweet User ID</a></li>
<li><a href="#sec-7-4-5">7.4.5 Submit page</a></li>
<li><a href="#sec-7-4-6">7.4.6 success page</a></li>
<li><a href="#sec-7-4-7">7.4.7 Here is my success page in HTML</a></li>
<li><a href="#sec-7-4-8">7.4.8 my logout page</a></li>
<li><a href="#sec-7-4-9">7.4.9 my LoginForm page</a></li>
<li><a href="#sec-7-4-10">7.4.10 style.css file</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-8">8 Client-side or Front-End Development work</a>
<ul>
<li><a href="#sec-8-1">8.1 JavaScript code for front-end</a></li>
<li><a href="#sec-8-2">8.2 HTML code for front-end</a></li>
</ul>
</li>
<li><a href="#sec-9">9 clipboard</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">

<p>Essentially we are trying to implement the notion of Semantic Style
Sheets. Style Sheets essentially provide alternate views to one
singular content. In our case we wish to provide alternate narratives
to one singular narrative. The alternative narratives may be more
meaningful to end users. This idea of a more meaningful narrative is
what we are calling semantic. So, a semantic style sheet is a
renarrating a existing page into something that has more meaning to an
enduser.
</p>
<p>
The renarration of a page to a more meaningful version is a type of
page transformation. We see the page transformation involving new set
of parameters
</p><ul>
<li>'d' a data-structure (perhaps an ontology) to markup a page into a
  semantically meaningful setup. This is user-defined.
</li>
<li>'v' a data-structure (perhaps an ontology) to define the various
  communities to which viewer belongs to. This defines which view to
  show to a community of user.
</li>
<li>'r' this defines the renarration rules. This is also a
  data-structure (perhaps an ontology) which gives the various choices
  of renarration that are possible for a markup.
</li>
</ul>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Requirements</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> overview of requirement</h3>
<div class="outline-text-3" id="text-2-1">

<p>The overall aim is to develop a tool that would enable the following:
</p><ul>
<li>an editor environment
</li>
</ul>

<p>++ a user should be able to define a document structure (as an
 ontology). This we are calling as 'd' in our transformation function
+++ this ontology will initially be a simple data structure. Over time
 it will evolve into a more elaborate, user definable ontology.
++ a user should be able to import a web page by inputing a URL in the
 input text area
++ a user should be able to markup an input html doc with user defined tags (based on a user ontology, which we
  are calling 'd') 
</p>
<ul>
<li>a viewer environment 
</li>
</ul>

<p>++ a viewer where a user is allowed to see a marked-up file in a newly
renarrated manner
+++ for this to happen, the user is identified as part of a viewer
ontology called 'v'. Initially we will pre-define this ontology as a
simple data-structure. Over time this will evolve into a more
elaborate ontology that is user definable.
+++ there is also a rules for renarration 'r' that we will be using to
define how one must transform a marked-up content. This can be quite
elaborate. However, for the initial round, we will fix this to be a
simple structure and evolve it into a more complex ontology over time.
</p>

</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> roadmap of activity</h3>
<div class="outline-text-3" id="text-2-2">

<p>This Semantic Style Sheet system will be developed in releases called
r0, r1, r2, r3&hellip; 
</p>
<ul>
<li>r0 - basic implementation of a python server, client side pages to
  input URLs, view web pages
</li>
<li>r1 - ability to markup a web page, adding a simple 'd'
</li>
<li>r2 - ability to persist the markup done in r1 (database)
</li>
<li>r3 - ability to input 'v' and 'r'
</li>
<li>etc.
</li>
</ul>



</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> r0 - release 0 requirement</h3>
<div class="outline-text-3" id="text-2-3">

<ul>
<li>To develop a client server app using Python backend. 
</li>
<li>The UI should be sufficient to take on a URL.
</li>
<li>There should be an ability to view a userinput page.
</li>
</ul>



<p>
To develop a SweetApp. Aim of the app would be able to manipulate
Sweets. By manipulation I mean that I should be able to create and
query sweets of my own making. They should be independent of any
specific Sweet App. 
</p>

</div>
</div>

</div>
