SweetSai.tex
% Created 2016-03-02 Wed 15:08
\documentclass[11pt]{article}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{SweetSai - a Sweet based web app dev effort for Semantic Style Sheets}
\author{Sai Gollapudi}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\setcounter{tocdepth}{3}
\tableofcontents
\vspace*{1cm}

\section{Introduction}
\label{sec-1}

Essentially we are trying to implement the notion of Semantic Style
Sheets. Style Sheets essentially provide alternate views to one
singular content. In our case we wish to provide alternate narratives
to one singular narrative. The alternative narratives may be more
meaningful to end users. This idea of a more meaningful narrative is
what we are calling semantic. So, a semantic style sheet is a
renarrating a existing page into something that has more meaning to an
enduser.

The renarration of a page to a more meaningful version is a type of
page transformation. We see the page transformation involving new set
of parameters
\begin{itemize}
\item `d' a data-structure (perhaps an ontology) to markup a page into a
  semantically meaningful setup. This is user-defined.
\item `v' a data-structure (perhaps an ontology) to define the various
  communities to which viewer belongs to. This defines which view to
  show to a community of user.
\item `r' this defines the renarration rules. This is also a
  data-structure (perhaps an ontology) which gives the various choices
  of renarration that are possible for a markup.
\end{itemize}
\section{Requirements}
\label{sec-2}
\subsection{overview of requirement}
\label{sec-2-1}

The overall aim is to develop a tool that would enable the following:
\begin{itemize}
\item an editor environment
\end{itemize}
++ a user should be able to define a document structure (as an
 ontology). This we are calling as `d' in our transformation function
+++ this ontology will initially be a simple data structure. Over time
 it will evolve into a more elaborate, user definable ontology.
++ a user should be able to import a web page by inputing a URL in the
 input text area
++ a user should be able to markup an input html doc with user defined tags (based on a user ontology, which we
  are calling `d') 

\begin{itemize}
\item a viewer environment
\end{itemize}
++ a viewer where a user is allowed to see a marked-up file in a newly
renarrated manner
+++ for this to happen, the user is identified as part of a viewer
ontology called `v'. Initially we will pre-define this ontology as a
simple data-structure. Over time this will evolve into a more
elaborate ontology that is user definable.
+++ there is also a rules for renarration `r' that we will be using to
define how one must transform a marked-up content. This can be quite
elaborate. However, for the initial round, we will fix this to be a
simple structure and evolve it into a more complex ontology over time.
\subsection{roadmap of activity}
\label{sec-2-2}

This Semantic Style Sheet system will be developed in releases called
r0, r1, r2, r3\ldots{} 

\begin{itemize}
\item r0 - basic implementation of a python server, client side pages to
  input URLs, view web pages
\item r1 - ability to markup a web page, adding a simple `d'
\item r2 - ability to persist the markup done in r1 (database)
\item r3 - ability to input `v' and `r'
\item etc.
\end{itemize}
\subsection{r0 - release 0 requirement}
\label{sec-2-3}

\begin{itemize}
\item To develop a client server app using Python backend.
\item The UI should be sufficient to take on a URL.
\item There should be an ability to view a userinput page.
\end{itemize}


To develop a SweetApp. Aim of the app would be able to manipulate
Sweets. By manipulation I mean that I should be able to create and
query sweets of my own making. They should be independent of any
specific Sweet App. 
