SweetSai.org
* Design
This pilot, experimental appliction is designed as a client server web
application. There is a server side and a client side to it. The
inspiration for this work comes from looking at other Sweet based apps
like Alipi, Swtr and Restory. These can be found [here :
https://github.com/janastu] on github at janastu.

** installation information
+ assuming we have Python, Flask, Jinja2, MongoDB already installed
+ tangle the SweetSai.org file to get codeblocks. Some will be in the
  current directory, some will be in ./app directory, yet others in
  ./app/static, ./app/templates, ./app/static/css, and in
  ./app/static/js directories.

** execution information
+ the app will run on local host at 127.0.0.1:5000 port
+ to run we need to activate the virtual environment of sweetEnv by
  typing ./sweetEnv/bin/activate
+ to deactivate the virutatal environment, type in deactivate
+ to execute this application, type in the virtual environment, the
  following: python SweetSai.py. Go to a browser and look for the app
  running at the 127.0.0.1:5000 local address.

** server side 
Initial design choices are based on reference works already done for
Sweets and similar apps. Some choices of technology include
- Python 2.7 for scripting
- Flask (micro web development environment)
- WTF for forms
- Requests library for creating / handling HTTP requests
- sqlite database - I am using sqlite database for my work. For this
  we need to have Flask-sqlalchemy and sqlalchemy-migrate packages
  installed. As each database is stored in a single file and there is no need to start a database server, this is a
good choice for our application.
- I am also opting to use MongoDb for persistence of information.

When working with Node.js for AngularJS, I used npm package manager.

*** CORS
In our initial part of the development we only needed to display the
Sweets that we could GET via the front-end app from the existing
back-end swtrstore (Sweet Store). To do this we could conceptually just rely on the frontend, which would be
develop using JavaScript. This would make HTTP GET request to the
Sweet Store and fetch us the HTML page with the Sweets, and then
essential display this gathered info.

There is one challenge to this design approach - CORS. CORS security
check would forbid the browser to do a cross-domain request to the
Sweet Store. That is, by design a Client (browser) should be
contacting the Server (Sweet Store). However, the Sweet Store server
(due to CORS) will not trust our domain and not accept our HTTP
requests. 

To overcome this, we are actually not anymore calling the Sweet Store
from the front-end web browser, but actually calling the store from
this back-end or server-side code. 

Due to this, we need to make our Client (Browser) talk to
our own trusted Server (written up in Python/Flask) and then, in turn,
have that local server be registered with Sweet Store as a trusted
domain and then, finally, have our trusted local domain work with Sweet
Store. The exchange between our trusted local domain Server and our
Client browser can happen using JSON objects - which need to be
formatted by the client for viewing on the client side. Essentially
the connectivity then is from our BrowserClient to our trusted Local
Server. This is in JSON. Then, our trusted Local Server then connects
with Sweet Store directly using Python/ Flask based HTTP protocol
(which does not incur CORS treatment). 


Here a Python code makes a request to the Sweet store, gathers the
Sweets from that using an API. This gathered info is in the form of a
JSON object. This sweet store furnished JSON object would then be
filtered on the front-end and then displayed.

If we just seek the [[http://teststore.swtr.us][Sweet Store Page]], we get the HTML output. But, we
can actually call in the API [[http://teststore.swtr.us/api/sweets/q?who=SaiGo][here]]. This is where the Sweet Store API
rests. This API allows us to fetch the JSON objects.  

*** SWeet Store API
Normal Sweet Store HTML page is available at
http://teststore.swtr.us. The API is available at http://teststore.swtr.us/api/sweets/q?who=SaiGo 
Post "q?" one can query who=<userid>, or what=<context>, or
where<url>. Or, have a combination of all of these. The connector is
the "&" symbol. 

The object that is returned will be a JSON object. 

** client side
??Angular JS framework is being used for doing the FrontEnd JavaScript
development. For AngularJS package management (in the front-end), I
use Bower. Bower is to AngularJS what "npm" is to Node.js (in the
back-end). I use "Karma" the test runner for my Angular JS front-end.

