SweetSai.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Design</h2>
<div class="outline-text-2" id="text-3">

<p>This pilot, experimental appliction is designed as a client server web
application. There is a server side and a client side to it. The
inspiration for this work comes from looking at other Sweet based apps
like Alipi, Swtr and Restory. These can be found [here :
<a href="https://github.com/janastu">https://github.com/janastu</a>] on github at janastu.
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> installation information</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>assuming we have Python, Flask, Jinja2, MongoDB already installed
</li>
<li>tangle the SweetSai.org file to get codeblocks. Some will be in the
  current directory, some will be in ./app directory, yet others in
  ./app/static, ./app/templates, ./app/static/css, and in
  ./app/static/js directories.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> execution information</h3>
<div class="outline-text-3" id="text-3-2">

<ul>
<li>the app will run on local host at 127.0.0.1:5000 port
</li>
<li>to run we need to activate the virtual environment of sweetEnv by
  typing ./sweetEnv/bin/activate
</li>
<li>to deactivate the virutatal environment, type in deactivate
</li>
<li>to execute this application, type in the virtual environment, the
  following: python SweetSai.py. Go to a browser and look for the app
  running at the 127.0.0.1:5000 local address.
</li>
</ul>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> server side</h3>
<div class="outline-text-3" id="text-3-3">

<p>Initial design choices are based on reference works already done for
Sweets and similar apps. Some choices of technology include
</p><ul>
<li>Python 2.7 for scripting
</li>
<li>Flask (micro web development environment)
</li>
<li>WTF for forms
</li>
<li>Requests library for creating / handling HTTP requests
</li>
<li>sqlite database - I am using sqlite database for my work. For this
  we need to have Flask-sqlalchemy and sqlalchemy-migrate packages
  installed. As each database is stored in a single file and there is no need to start a database server, this is a
</li>
</ul>

<p>good choice for our application.
</p><ul>
<li>I am also opting to use MongoDb for persistence of information.
</li>
</ul>


<p>
When working with Node.js for AngularJS, I used npm package manager.
</p>

</div>

<div id="outline-container-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> CORS</h4>
<div class="outline-text-4" id="text-3-3-1">

<p>In our initial part of the development we only needed to display the
Sweets that we could GET via the front-end app from the existing
back-end swtrstore (Sweet Store). To do this we could conceptually just rely on the frontend, which would be
develop using JavaScript. This would make HTTP GET request to the
Sweet Store and fetch us the HTML page with the Sweets, and then
essential display this gathered info.
</p>
<p>
There is one challenge to this design approach - CORS. CORS security
check would forbid the browser to do a cross-domain request to the
Sweet Store. That is, by design a Client (browser) should be
contacting the Server (Sweet Store). However, the Sweet Store server
(due to CORS) will not trust our domain and not accept our HTTP
requests. 
</p>
<p>
To overcome this, we are actually not anymore calling the Sweet Store
from the front-end web browser, but actually calling the store from
this back-end or server-side code. 
</p>
<p>
Due to this, we need to make our Client (Browser) talk to
our own trusted Server (written up in Python/Flask) and then, in turn,
have that local server be registered with Sweet Store as a trusted
domain and then, finally, have our trusted local domain work with Sweet
Store. The exchange between our trusted local domain Server and our
Client browser can happen using JSON objects - which need to be
formatted by the client for viewing on the client side. Essentially
the connectivity then is from our BrowserClient to our trusted Local
Server. This is in JSON. Then, our trusted Local Server then connects
with Sweet Store directly using Python/ Flask based HTTP protocol
(which does not incur CORS treatment). 
</p>

<p>
Here a Python code makes a request to the Sweet store, gathers the
Sweets from that using an API. This gathered info is in the form of a
JSON object. This sweet store furnished JSON object would then be
filtered on the front-end and then displayed.
</p>
<p>
If we just seek the <a href="http://teststore.swtr.us">Sweet Store Page</a>, we get the HTML output. But, we
can actually call in the API <a href="http://teststore.swtr.us/api/sweets/q?who=SaiGo">here</a>. This is where the Sweet Store API
rests. This API allows us to fetch the JSON objects.  
</p>
</div>

</div>

<div id="outline-container-3-3-2" class="outline-4">
<h4 id="sec-3-3-2"><span class="section-number-4">3.3.2</span> SWeet Store API</h4>
<div class="outline-text-4" id="text-3-3-2">

<p>Normal Sweet Store HTML page is available at
<a href="http://teststore.swtr.us">http://teststore.swtr.us</a>. The API is available at <a href="http://teststore.swtr.us/api/sweets/q?who=SaiGo">http://teststore.swtr.us/api/sweets/q?who=SaiGo</a> 
Post "q?" one can query who=&lt;userid&gt;, or what=&lt;context&gt;, or
where&lt;url&gt;. Or, have a combination of all of these. The connector is
the "&amp;" symbol. 
</p>
<p>
The object that is returned will be a JSON object. 
</p>
</div>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> client side</h3>
<div class="outline-text-3" id="text-3-4">

<p>??Angular JS framework is being used for doing the FrontEnd JavaScript
development. For AngularJS package management (in the front-end), I
use Bower. Bower is to AngularJS what "npm" is to Node.js (in the
back-end). I use "Karma" the test runner for my Angular JS front-end.
</p>
</div>

</div>
