SweetSai.tex
\section{Design}
\label{sec-3}

This pilot, experimental appliction is designed as a client server web
application. There is a server side and a client side to it. The
inspiration for this work comes from looking at other Sweet based apps
like Alipi, Swtr and Restory. These can be found [here :
\href{https://github.com/janastu}{https://github.com/janastu}] on github at janastu.
\subsection{installation information}
\label{sec-3-1}

\begin{itemize}
\item assuming we have Python, Flask, Jinja2, MongoDB already installed
\item tangle the SweetSai.org file to get codeblocks. Some will be in the
  current directory, some will be in ./app directory, yet others in
  ./app/static, ./app/templates, ./app/static/css, and in
  ./app/static/js directories.
\end{itemize}
\subsection{execution information}
\label{sec-3-2}

\begin{itemize}
\item the app will run on local host at 127.0.0.1:5000 port
\item to run we need to activate the virtual environment of sweetEnv by
  typing ./sweetEnv/bin/activate
\item to deactivate the virutatal environment, type in deactivate
\item to execute this application, type in the virtual environment, the
  following: python SweetSai.py. Go to a browser and look for the app
  running at the 127.0.0.1:5000 local address.
\end{itemize}
\subsection{server side}
\label{sec-3-3}

Initial design choices are based on reference works already done for
Sweets and similar apps. Some choices of technology include
\begin{itemize}
\item Python 2.7 for scripting
\item Flask (micro web development environment)
\item WTF for forms
\item Requests library for creating / handling HTTP requests
\item sqlite database - I am using sqlite database for my work. For this
  we need to have Flask-sqlalchemy and sqlalchemy-migrate packages
  installed. As each database is stored in a single file and there is no need to start a database server, this is a
\end{itemize}
good choice for our application.
\begin{itemize}
\item I am also opting to use MongoDb for persistence of information.
\end{itemize}

When working with Node.js for AngularJS, I used npm package manager.
\subsubsection{CORS}
\label{sec-3-3-1}

In our initial part of the development we only needed to display the
Sweets that we could GET via the front-end app from the existing
back-end swtrstore (Sweet Store). To do this we could conceptually just rely on the frontend, which would be
develop using JavaScript. This would make HTTP GET request to the
Sweet Store and fetch us the HTML page with the Sweets, and then
essential display this gathered info.

There is one challenge to this design approach - CORS. CORS security
check would forbid the browser to do a cross-domain request to the
Sweet Store. That is, by design a Client (browser) should be
contacting the Server (Sweet Store). However, the Sweet Store server
(due to CORS) will not trust our domain and not accept our HTTP
requests. 

To overcome this, we are actually not anymore calling the Sweet Store
from the front-end web browser, but actually calling the store from
this back-end or server-side code. 

Due to this, we need to make our Client (Browser) talk to
our own trusted Server (written up in Python/Flask) and then, in turn,
have that local server be registered with Sweet Store as a trusted
domain and then, finally, have our trusted local domain work with Sweet
Store. The exchange between our trusted local domain Server and our
Client browser can happen using JSON objects - which need to be
formatted by the client for viewing on the client side. Essentially
the connectivity then is from our BrowserClient to our trusted Local
Server. This is in JSON. Then, our trusted Local Server then connects
with Sweet Store directly using Python/ Flask based HTTP protocol
(which does not incur CORS treatment). 


Here a Python code makes a request to the Sweet store, gathers the
Sweets from that using an API. This gathered info is in the form of a
JSON object. This sweet store furnished JSON object would then be
filtered on the front-end and then displayed.

If we just seek the \href{http://teststore.swtr.us}{Sweet Store Page}, we get the HTML output. But, we
can actually call in the API \href{http://teststore.swtr.us/api/sweets/q?who=SaiGo}{here}. This is where the Sweet Store API
rests. This API allows us to fetch the JSON objects.  
\subsubsection{SWeet Store API}
\label{sec-3-3-2}

Normal Sweet Store HTML page is available at
\href{http://teststore.swtr.us}{http://teststore.swtr.us}. The API is available at \href{http://teststore.swtr.us/api/sweets/q?who=SaiGo}{http://teststore.swtr.us/api/sweets/q?who=SaiGo} 
Post ``q?'' one can query who=<userid>, or what=<context>, or
where<url>. Or, have a combination of all of these. The connector is
the ``\&'' symbol. 

The object that is returned will be a JSON object. 
\subsection{client side}
\label{sec-3-4}

??Angular JS framework is being used for doing the FrontEnd JavaScript
development. For AngularJS package management (in the front-end), I
use Bower. Bower is to AngularJS what ``npm'' is to Node.js (in the
back-end). I use ``Karma'' the test runner for my Angular JS front-end.
