SweetSai.html

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Software Engineering aspects</h3>
<div class="outline-text-3" id="text-3-5">

<p>Software Engineering design choices include
</p><ul>
<li>using emacs-org-mode for Literate Programming 
</li>
<li>using Virtual Environments
</li>
<li>developing the app in multiple releases r0, r1, r2&hellip;
</li>
</ul>



</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> implementation</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> basic layout &amp; structure</h3>
<div class="outline-text-3" id="text-4-1">

<p>Some of the coding and structure for this work has been inspired by a
tutorial by Miguel grinberg. 
[http://blog.miguelgrinberg.com/post/the-flask-mega-tutorial-part-iii-web-forms:
Here] is that tutorial.
</p>
<p>
Directory structure for this app is like this:
SweetSai/sweetEnv - for Virtual Environment
SweetSai/app - for packages
SweetSai/app/templates - for web based templates; html files
SweetSai/app/static - for static files
</p>

<p>
The development of this work has been done in two parts: Editor and
Viewer. Both have been implemented in the MVC design pattern.
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Editor</h3>
<div class="outline-text-3" id="text-4-2">

<p>Editor has been implemented as a portal using Python, Flask, Jinja2
framework. It is being executed in a virtual environment. 
</p>
</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> model (database work)</h4>
<div class="outline-text-4" id="text-4-2-1">

<ul>
<li id="sec-4-2-1-1">database related files<br/>
We chose sqlite database for our work. we had to update the config file with sqlite database related
constants: SQLALCHEMY<sub>DATABASE</sub><sub>URI</sub> and SQLALCHEMY<sub>MIGRATE</sub><sub>REPO</sub>.

<p>
we intialize our database in our init.py file.
</p>
<p>
our database is expressed as objects. This is defined in our models.py
file.
</p></li>
</ul>
<ul>
<li id="sec-4-2-1-2">models.py file<br/>
In the MVC architecture, this part &ndash; dealing with models &ndash; relates
to the models of the database and app that i have used.



<pre class="example">from app import db

# creating an object for a table named User
class User(db.Model):
   id            = db.Column(db.Integer,     primary_key = True)
   login_name    = db.Column(db.String(64),  index=True, unique=True)
   login_emailID = db.Column(db.String(120), index=True, unique=True)
   sweets        = db.relationship('Sweet', backref='author', lazy='dynamic')

   # should the user be allowed to authenticate?
   def is_authenticated(self):
       return True

   # banned users can be considered inactive    
   def is_active(self):
       return True

   # fake users who are not allowed to even log on
   def is_anonymous(self):
       return False

   # returns a unique identifier for user    
   def get_id(self):
       try:
           return unicode(self.id) # python 2
       except NameError:
          return str(self.id)      # python 3

   def __repr__(self):
       return '&lt;User %r&gt;' % (self.login_name)


class Sweet(db.Model):
   id        = db.Column(db.Integer,     primary_key=True)

   # the "s" in front represents the notion of a "sweet"; these are
   # attributes of a "sweet"
   sUsrname  = db.Column(db.String(64),  index=True, unique=True) #this is the Sweet user name
   sUrl      = db.Column(db.String(320), index=True, unique=True)
   sContext  = db.Column(db.String(64),  index=True, unique=True)
   sAttrib   = db.Column(db.Text,        index=True, unique=True)
   sTimestamp= db.Column(db.DateTime)
   sUser_id  = db.Column(db.Integer,     db.ForeignKey('user.id'))

   def __repr__(self):
       return '&lt;Sweet %r&gt;' % (self.sUsrname)

</pre>


</li>
</ul>
<ul>
<li id="sec-4-2-1-3">Table of Users<br/>
Definition for User table



<pre class="example"># creating an object for a table named User
class User(db.Model):
   id            = db.Column(db.Integer,     primary_key = True)
   login_name    = db.Column(db.String(64),  index=True, unique=True)
   login_emailID = db.Column(db.String(120), index=True, unique=True)
   sweets        = db.relationship('Sweet', backref='author', lazy='dynamic')

   # should the user be allowed to authenticate?
   def is_authenticated(self):
       return True

   # banned users can be considered inactive    
   def is_active(self):
       return True

   # fake users who are not allowed to even log on
   def is_anonymous(self):
       return False

   # returns a unique identifier for user    
   def get_id(self):
       try:
           return unicode(self.id) # python 2
       except NameError:
          return str(self.id)      # python 3

   def __repr__(self):
       return '&lt;User %r&gt;' % (self.login_name)

</pre>


</li>
</ul>
<ul>
<li id="sec-4-2-1-4">Table of Sweets<br/>
Definition for Sweet table. creating an object for a table named
Sweet. Sweet has its own ID&hellip; but it also has a link with User table one User can scribe multiple Sweets



<pre class="example">class Sweet(db.Model):
   id        = db.Column(db.Integer,     primary_key=True)

   # the "s" in front represents the notion of a "sweet"; these are
   # attributes of a "sweet"
   sUsrname  = db.Column(db.String(64),  index=True, unique=True) #this is the Sweet user name
   sUrl      = db.Column(db.String(320), index=True, unique=True)
   sContext  = db.Column(db.String(64),  index=True, unique=True)
   sAttrib   = db.Column(db.Text,        index=True, unique=True)
   sTimestamp= db.Column(db.DateTime)
   sUser_id  = db.Column(db.Integer,     db.ForeignKey('user.id'))

   def __repr__(self):
       return '&lt;Sweet %r&gt;' % (self.sUsrname)
</pre>



</li>
</ul>
<ul>
