SweetSai.tex
\subsection{Software Engineering aspects}
\label{sec-3-5}

Software Engineering design choices include
\begin{itemize}
\item using emacs-org-mode for Literate Programming
\item using Virtual Environments
\item developing the app in multiple releases r0, r1, r2\ldots{}
\end{itemize}
\section{implementation}
\label{sec-4}
\subsection{basic layout \& structure}
\label{sec-4-1}

Some of the coding and structure for this work has been inspired by a
tutorial by Miguel grinberg. 
[http://blog.miguelgrinberg.com/post/the-flask-mega-tutorial-part-iii-web-forms:
Here] is that tutorial.

Directory structure for this app is like this:
SweetSai/sweetEnv - for Virtual Environment
SweetSai/app - for packages
SweetSai/app/templates - for web based templates; html files
SweetSai/app/static - for static files


The development of this work has been done in two parts: Editor and
Viewer. Both have been implemented in the MVC design pattern.
\subsection{Editor}
\label{sec-4-2}

Editor has been implemented as a portal using Python, Flask, Jinja2
framework. It is being executed in a virtual environment. 
\subsubsection{model (database work)}
\label{sec-4-2-1}
\begin{itemize}

\item database related files\\
\label{sec-4-2-1-1}%
We chose sqlite database for our work. we had to update the config file with sqlite database related
constants: SQLALCHEMY$_{\mathrm{DATABASE}}$$_{\mathrm{URI}}$ and SQLALCHEMY$_{\mathrm{MIGRATE}}$$_{\mathrm{REPO}}$.

we intialize our database in our init.py file.

our database is expressed as objects. This is defined in our models.py
file.

\item models.py file\\
\label{sec-4-2-1-2}%
In the MVC architecture, this part -- dealing with models -- relates
to the models of the database and app that i have used.

\begin{verbatim}
from app import db

# creating an object for a table named User
class User(db.Model):
   id            = db.Column(db.Integer,     primary_key = True)
   login_name    = db.Column(db.String(64),  index=True, unique=True)
   login_emailID = db.Column(db.String(120), index=True, unique=True)
   sweets        = db.relationship('Sweet', backref='author', lazy='dynamic')

   # should the user be allowed to authenticate?
   def is_authenticated(self):
       return True

   # banned users can be considered inactive    
   def is_active(self):
       return True

   # fake users who are not allowed to even log on
   def is_anonymous(self):
       return False

   # returns a unique identifier for user    
   def get_id(self):
       try:
           return unicode(self.id) # python 2
       except NameError:
          return str(self.id)      # python 3

   def __repr__(self):
       return '<User %r>' % (self.login_name)


class Sweet(db.Model):
   id        = db.Column(db.Integer,     primary_key=True)

   # the "s" in front represents the notion of a "sweet"; these are
   # attributes of a "sweet"
   sUsrname  = db.Column(db.String(64),  index=True, unique=True) #this is the Sweet user name
   sUrl      = db.Column(db.String(320), index=True, unique=True)
   sContext  = db.Column(db.String(64),  index=True, unique=True)
   sAttrib   = db.Column(db.Text,        index=True, unique=True)
   sTimestamp= db.Column(db.DateTime)
   sUser_id  = db.Column(db.Integer,     db.ForeignKey('user.id'))

   def __repr__(self):
       return '<Sweet %r>' % (self.sUsrname)
\end{verbatim}


\item Table of Users\\
\label{sec-4-2-1-3}%
Definition for User table

\begin{verbatim}
# creating an object for a table named User
class User(db.Model):
   id            = db.Column(db.Integer,     primary_key = True)
   login_name    = db.Column(db.String(64),  index=True, unique=True)
   login_emailID = db.Column(db.String(120), index=True, unique=True)
   sweets        = db.relationship('Sweet', backref='author', lazy='dynamic')

   # should the user be allowed to authenticate?
   def is_authenticated(self):
       return True

   # banned users can be considered inactive    
   def is_active(self):
       return True

   # fake users who are not allowed to even log on
   def is_anonymous(self):
       return False

   # returns a unique identifier for user    
   def get_id(self):
       try:
           return unicode(self.id) # python 2
       except NameError:
          return str(self.id)      # python 3

   def __repr__(self):
       return '<User %r>' % (self.login_name)
\end{verbatim}


\item Table of Sweets\\
\label{sec-4-2-1-4}%
Definition for Sweet table. creating an object for a table named
Sweet. Sweet has its own ID\ldots{} but it also has a link with User table one User can scribe multiple Sweets

\begin{verbatim}
class Sweet(db.Model):
   id        = db.Column(db.Integer,     primary_key=True)

   # the "s" in front represents the notion of a "sweet"; these are
   # attributes of a "sweet"
   sUsrname  = db.Column(db.String(64),  index=True, unique=True) #this is the Sweet user name
   sUrl      = db.Column(db.String(320), index=True, unique=True)
   sContext  = db.Column(db.String(64),  index=True, unique=True)
   sAttrib   = db.Column(db.Text,        index=True, unique=True)
   sTimestamp= db.Column(db.DateTime)
   sUser_id  = db.Column(db.Integer,     db.ForeignKey('user.id'))

   def __repr__(self):
       return '<Sweet %r>' % (self.sUsrname)
\end{verbatim}
