SweetSai.html
<li id="sec-4-2-1-5">db Creation script file: db<sub>create</sub>.py<br/>
Here is a python script that creates the database




<pre class="example">#!sweetEnv/bin/python

# the source for this comes from 
# http://blog.miguelgrinberg.com/post/the-flask-mega-tutorial-part-iv-database
# this is a database migration script used for moving from one to 
# another version of a database

from migrate.versioning import api
from config import SQLALCHEMY_DATABASE_URI
from config import SQLALCHEMY_MIGRATE_REPO
from app import db
import os.path

db.create_all()
if not os.path.exists(SQLALCHEMY_MIGRATE_REPO):
    api.create(SQLALCHEMY_MIGRATE_REPO, 'database repository')
    api.version_control(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)
else:
    api.version_control(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO, api.version(SQLALCHEMY_MIGRATE_REPO))
</pre>


<p>
to create the database we just need to run the following python
command in our virtual environment:
</p>


<pre class="example">./db_create.py
</pre>

<p>
This will create a database with the label app.db file. This will be a
sqlite database. the script will also create a directory called
"db<sub>repository</sub>". This new directory wiill store the db migration files.
</p>

</li>
</ul>
<ul>
<li id="sec-4-2-1-6">db Migration script file: db<sub>migrate</sub>.py<br/>
migration is implemented to allow us to (in the future) to change the
model of the database. Here is a script in python to facilitate that.




<pre class="example">#!sweetEnv/bin/python
import imp
from migrate.versioning import api
from app import db
from config import SQLALCHEMY_DATABASE_URI
from config import SQLALCHEMY_MIGRATE_REPO

v = api.db_version(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)
migration = SQLALCHEMY_MIGRATE_REPO + ('/versions/%03d_migration.py' % (v+1))
tmp_module = imp.new_module('old_model')

old_model = api.create_model(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)
exec(old_model, tmp_module.__dict__)
script = api.make_update_script_for_model(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO, tmp_module.meta, db.metadata)
open(migration, "wt").write(script)

api.upgrade(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)
v = api.db_version(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)

print('New migration saved as ' + migration)
print('Current database version: ' + str(v))
</pre>


<p>
To ensure proper migration tracking, try to not rename existing
fields. Limit changes to addition / deletion of fields only. Typing
can also be changed. Generated migration script can also be checked to
see if it is correct. 
</p>
<p>
migration script can be run by executing the following python script
in our virtual environment
</p>



<pre class="example">./db_migrate.py
</pre>

<p>
The script has print statements to show where the migration has been
stored. version number is also displayed by this script.
</p>




</li>
</ul>
<ul>
<li id="sec-4-2-1-7">db upgradation script file: db<sub>upgrade</sub>.py<br/>
This python script upgrades the sqlite database to the latest revision.



<pre class="example">#!sweetEnv/bin/python
from migrate.versioning import api
from config import SQLALCHEMY_DATABASE_URI
from config import SQLALCHEMY_MIGRATE_REPO

api.upgrade(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)
v = api.db_version(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)

print('Current database version: ' + str(v))
</pre>



</li>
</ul>
<ul>
<li id="sec-4-2-1-8">db downgrade script file: db<sub>downgrade</sub>.py<br/>
This python script downgrades the sqlite database by one version.



<pre class="example">#!sweetEnv/bin/python
from migrate.versioning import api
from config import SQLALCHEMY_DATABASE_URI
from config import SQLALCHEMY_MIGRATE_REPO

v = api.db_version(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)
api.downgrade(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO, v - 1)
v = api.db_version(SQLALCHEMY_DATABASE_URI, SQLALCHEMY_MIGRATE_REPO)

print('Current database version: ' + str(v))
</pre>



</li>
</ul>
</div>

</div>
