SweetSai.html
<li id="sec-4-2-2-2">View for showing the page given by the user's URL<br/>
Here is the code for the showall view, which is used for seeing all
the sweets.



<pre class="example">@app.route('/showPg')
def showURL_page():
    return render_template('showPg.html', 
                           title='user_entered_page', 
                           url='www.google.com')
</pre>


</li>
</ul>
<ul>
<li id="sec-4-2-2-3">View for Index<br/>
Here is the code for the index view. It also is used for "/" view.



<pre class="example">@app.route('/')
@app.route('/index')
def home_page():
    form = MyForm()
    return render_template('welcome.html', form=form)
</pre>


<p>
Here is the html code for the welcome  page. It includes a patch fix.
</p></li>
</ul>
</div>

</div>

<div id="outline-container-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> my welcome page</h4>
<div class="outline-text-4" id="text-4-2-3">




<pre class="example">&lt;!doctype&gt;
&lt;head&gt;
  &lt;style type="text/css" rel="stylesheet"&gt;
  #inputurl {
  width:85%;
  height:35px;
  background-color:#efd;
  }
  button {
  width:12%;
  background-color:#4d9;
  height:36px;
  font-size:20px;
  font-style:italic;
}
&lt;/style&gt;
  &lt;title&gt; Renarrator &lt;/title&gt;
  &lt;p&gt;
   &lt;br&gt; this is a Sweets based web application tool
   &lt;br&gt; creator: Sai Gollapudi
   &lt;br&gt;
   &lt;br&gt; the purpose is to be able to do SSS
  &lt;/p&gt;

  &lt;script type="text/javascript"&gt;
    function wget() {
        foruri = document.getElementById("inputurl").value;
        if(foruri.substring(0,7) == "http://") {
           if(window.location.href == "http://dev.a11y.in/server/")    {
              window.open("http://dev.a11y.in/web?foruri=" + encodeURIComponent(foruri));
           }
           else {
              window.open("http://127.0.0.1:5000/?foruri=" + encodeURIComponent(foruri));
           }
        }
        else if (foruri.substring(0,8) == "https://") {
           window.open("http://127.0.0.1:5000/?foruri=" + encodeURIComponent(foruri));
        }
        else {
           alert("Please enter 'HTTP' protocoled URL");
        }
    }
  &lt;/script&gt;
&lt;/head&gt;

&lt;body&gt;
  &lt;fieldset&gt;
    &lt;legend&gt; Enter a URL  &lt;/legend&gt;
  &lt;input id="inputurl" placeholder="http://a11y.in/" /&gt;
  &lt;button type="submit" onClick="wget()"&gt; Get&lt;/button&gt;
  &lt;/fieldset&gt;
&lt;/body&gt;
&lt;/html&gt;

</pre>





</div>

</div>

<div id="outline-container-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> controller</h4>
<div class="outline-text-4" id="text-4-2-4">




</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> support infra</h3>
<div class="outline-text-3" id="text-4-3">


</div>

<div id="outline-container-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> Config.py file</h4>
<div class="outline-text-4" id="text-4-3-1">

<p>Before the app is launched we need to configure the various parameters
for use by the app. A config.py file has been setup for this purpose.
</p>
<p>
In this file we are configuring the authentication done by
Mozilla. the code related to Persona.js is dealing with this.
</p>
<p>
We are also configuring the mongodb.
</p>



<pre class="example">#to make the WTF forms in app highly secure 
WTF_CSRF_ENABLED = True  #this is for cross-site request forgery prevention
SECRET_KEY = '_Aum_JaiSaiRam,SuperD00perSecretKey_ThatUwillN0T_b_ab1E_2_GUESS?' # needed when CSRF is enabled; this makes a cryptographic token

import os
basedir = os.path.abspath(os.path.dirname(__file__))

#configuration info for the Mozilla Persona authorization work
PERSONA_JS='https://login.persona.org/include.js'
PERSONA_VERIFIER='https://verifier.login.persona.org/verify'

# sqlite database related constants
SQLALCHEMY_DATABASE_URI = 'sqlite:///' + os.path.join(basedir, 'app.db') # path to our database
SQLALCHEMY_MIGRATE_REPO = os.path.join(basedir, 'db_repository') # folder where we will store the SQLAlchemy migrate files.
</pre>


</div>

</div>

<div id="outline-container-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> _<sub>init</sub>__.py file</h4>
<div class="outline-text-4" id="text-4-3-2">

<p>When invoking the package called "app" I create my app object and
initialize it.
</p>



<pre class="example">import os
from flask import Flask
from flask.ext.login import LoginManager
from config import basedir
from flask.ext.sqlalchemy import SQLAlchemy

app = Flask(__name__)
app.config.from_object('config')

# creation database 
db = SQLAlchemy(app) # creating a db object which represents our database

# creation of login manager
lm = LoginManager()
lm.init_app(app)

# to avoid circular references we wait till application is loaded
from app import views, models
</pre>


</div>

</div>

<div id="outline-container-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> Authentication of user</h4>
<div class="outline-text-4" id="text-4-3-3">

<ul>
<li id="sec-4-3-3-1">Mozilla Persona based authentication<br/>
I am using mozilla Persona based authentication. This requires Flask
as well as "requests" libraries.

<p>
Personas require us to do some work before any requests come in the views
file.
</p></li>
</ul>
<ul>
<li id="sec-4-3-3-2">Persona.js file<br/>



<pre class="example">$(function() {
