SweetSai.tex



\item View for showing the page given by the user's URL\\
\label{sec-4-2-2-2}%
Here is the code for the showall view, which is used for seeing all
the sweets.

\begin{verbatim}
@app.route('/showPg')
def showURL_page():
    return render_template('showPg.html', 
                           title='user_entered_page', 
                           url='www.google.com')
\end{verbatim}


\item View for Index\\
\label{sec-4-2-2-3}%
Here is the code for the index view. It also is used for ``/'' view.

\begin{verbatim}
@app.route('/')
@app.route('/index')
def home_page():
    form = MyForm()
    return render_template('welcome.html', form=form)
\end{verbatim}

Here is the html code for the welcome  page. It includes a patch fix.
\end{itemize} % ends low level
\subsubsection{my welcome page}
\label{sec-4-2-3}


\begin{verbatim}
<!doctype>
<head>
  <style type="text/css" rel="stylesheet">
  #inputurl {
  width:85%;
  height:35px;
  background-color:#efd;
  }
  button {
  width:12%;
  background-color:#4d9;
  height:36px;
  font-size:20px;
  font-style:italic;
}
</style>
  <title> Renarrator </title>
  <p>
   <br> this is a Sweets based web application tool
   <br> creator: Sai Gollapudi
   <br>
   <br> the purpose is to be able to do SSS
  </p>

  <script type="text/javascript">
    function wget() {
        foruri = document.getElementById("inputurl").value;
        if(foruri.substring(0,7) == "http://") {
           if(window.location.href == "http://dev.a11y.in/server/")    {
              window.open("http://dev.a11y.in/web?foruri=" + encodeURIComponent(foruri));
           }
           else {
              window.open("http://127.0.0.1:5000/?foruri=" + encodeURIComponent(foruri));
           }
        }
        else if (foruri.substring(0,8) == "https://") {
           window.open("http://127.0.0.1:5000/?foruri=" + encodeURIComponent(foruri));
        }
        else {
           alert("Please enter 'HTTP' protocoled URL");
        }
    }
  </script>
</head>

<body>
  <fieldset>
    <legend> Enter a URL  </legend>
  <input id="inputurl" placeholder="http://a11y.in/" />
  <button type="submit" onClick="wget()"> Get</button>
  </fieldset>
</body>
</html>
\end{verbatim}
\subsubsection{controller}
\label{sec-4-2-4}
\subsection{support infra}
\label{sec-4-3}
\subsubsection{Config.py file}
\label{sec-4-3-1}

Before the app is launched we need to configure the various parameters
for use by the app. A config.py file has been setup for this purpose.

In this file we are configuring the authentication done by
Mozilla. the code related to Persona.js is dealing with this.

We are also configuring the mongodb.


\begin{verbatim}
#to make the WTF forms in app highly secure 
WTF_CSRF_ENABLED = True  #this is for cross-site request forgery prevention
SECRET_KEY = '_Aum_JaiSaiRam,SuperD00perSecretKey_ThatUwillN0T_b_ab1E_2_GUESS?' # needed when CSRF is enabled; this makes a cryptographic token

import os
basedir = os.path.abspath(os.path.dirname(__file__))

#configuration info for the Mozilla Persona authorization work
PERSONA_JS='https://login.persona.org/include.js'
PERSONA_VERIFIER='https://verifier.login.persona.org/verify'

# sqlite database related constants
SQLALCHEMY_DATABASE_URI = 'sqlite:///' + os.path.join(basedir, 'app.db') # path to our database
SQLALCHEMY_MIGRATE_REPO = os.path.join(basedir, 'db_repository') # folder where we will store the SQLAlchemy migrate files.
\end{verbatim}
\subsubsection{__init__.py file}
\label{sec-4-3-2}

When invoking the package called ``app'' I create my app object and
initialize it.


\begin{verbatim}
import os
from flask import Flask
from flask.ext.login import LoginManager
from config import basedir
from flask.ext.sqlalchemy import SQLAlchemy

app = Flask(__name__)
app.config.from_object('config')

# creation database 
db = SQLAlchemy(app) # creating a db object which represents our database

# creation of login manager
lm = LoginManager()
lm.init_app(app)

# to avoid circular references we wait till application is loaded
from app import views, models
\end{verbatim}
\subsubsection{Authentication of user}
\label{sec-4-3-3}
\begin{itemize}

\item Mozilla Persona based authentication\\
\label{sec-4-3-3-1}%
I am using mozilla Persona based authentication. This requires Flask
as well as ``requests'' libraries.

Personas require us to do some work before any requests come in the views
file.
