SweetSai.html

<div id="outline-container-7-4" class="outline-3">
<h3 id="sec-7-4"><span class="section-number-3">7.4</span> my HTML files</h3>
<div class="outline-text-3" id="text-7-4">


</div>

<div id="outline-container-7-4-1" class="outline-4">
<h4 id="sec-7-4-1"><span class="section-number-4">7.4.1</span> core or base template</h4>
<div class="outline-text-4" id="text-7-4-1">

<p>There is a core template upon which various views are built (or
appended). Here is that core skeleton that is elsewhere enhanced to
show various other views.
</p>


<pre class="example">
&lt;!DOCTYPE html&gt;
&lt;html&gt;
       &lt;meta name="viewport" content="width=device-width, initial-scale=1.0"&gt;
       &lt;link href="http://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap.min.css" rel="stylesheet" media="screen"&gt;
       &lt;style type="text/css"&gt;
         .container {
           max-width: 900px;
           padding-top: 10px;
         }
         h2 {color: red;}
       &lt;/style&gt;

       &lt;!-- will use nav-link macro to highlight the one that we are on --&gt;
       {% from "NavMacro.html" import nav_link with context %}

    &lt;nav class="navbar navbar-inverse" role="navigation"&gt;
     &lt;div class="container-fluid"&gt;
       &lt;div class="navbar-header"&gt;
         &lt;button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1"&gt;
           &lt;span class="sr-only"&gt;Toggle navigation&lt;/span&gt;
           &lt;span class="icon-bar"&gt;&lt;/span&gt;
           &lt;span class="icon-bar"&gt;&lt;/span&gt;
           &lt;span class="icon-bar"&gt;&lt;/span&gt;
         &lt;/button&gt;
         &lt;a class="navbar-brand" href="/index"&gt;Home&lt;/a&gt;
       &lt;/div&gt;

       &lt;div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1"&gt;
         &lt;ul class="nav navbar-nav"&gt;
           &lt;li class="active"&gt;&lt;a href="/login"&gt;Login&lt;/a&gt;&lt;/li&gt;
           &lt;li&gt;&lt;a href="/editor"&gt;Editor&lt;/a&gt;&lt;/li&gt;
           &lt;li&gt;&lt;a href="/showPg"&gt;ShowPg&lt;/a&gt;&lt;/li&gt;
           &lt;li&gt;&lt;a href="/showall"&gt;Showall &lt;/a&gt;&lt;/li&gt;
         &lt;/ul&gt;

         &lt;!-- search mechanism
         &lt;form class="navbar-form navbar-left" role="search"&gt;
           &lt;div class="form-group"&gt;
             &lt;input type="text" class="form-control" placeholder="Search"&gt;
           &lt;/div&gt;
           &lt;button type="submit" class="btn btn-default"&gt;Submit&lt;/button&gt;
         &lt;/form&gt;
         //--&gt;

         &lt;ul class="nav navbar-nav navbar-right"&gt;
           &lt;li&gt;&lt;a href="#"&gt;DefineSweet&lt;/a&gt;&lt;/li&gt;
           &lt;li class="dropdown"&gt;
             &lt;a href="#" class="dropdown-toggle" data-toggle="dropdown"&gt;User&lt;b class="caret"&gt;&lt;/b&gt;&lt;/a&gt;
             &lt;ul class="dropdown-menu"&gt;
               &lt;li&gt;&lt;a href="/login"&gt;Login&lt;/a&gt;&lt;/li&gt;
               &lt;li&gt;&lt;a href="#"&gt;About&lt;/a&gt;&lt;/li&gt;
               &lt;li&gt;&lt;a href="#"&gt;Action 1&lt;/a&gt;&lt;/li&gt;
               &lt;li&gt;&lt;a href="#"&gt;Action 2&lt;/a&gt;&lt;/li&gt;
               &lt;li class="divider"&gt;&lt;/li&gt;
               &lt;li&gt;&lt;a href="/logout"&gt;Signout&lt;/a&gt;&lt;/li&gt;
             &lt;/ul&gt;
           &lt;/li&gt;
         &lt;/ul&gt;
       &lt;/div&gt;&lt;!-- /.navbar-collapse --&gt;
     &lt;/div&gt;&lt;!-- /.container-fluid --&gt;
   &lt;/nav&gt;
   &lt;link rel=stylesheet type=text/css href="{{ url_for('static', filename='css/style.css') }}"&gt;
   &lt;head&gt; 
      {% if title %}
         &lt;title&gt; SWeeTapp - {{ title }} &lt;/title&gt;
      {% else %}
         &lt;title&gt; SWeeTapp &lt;/title&gt;
      {% endif %}     
   &lt;/head&gt;

   &lt;meta http-equiv="X-UA-Compatible" content="IE=Edge"&gt;
   &lt;script src="{{ config.PERSONA_JS }}"&gt;&lt;/script&gt;
   &lt;script src="//ajax.googleapis.com/ajax/libs/jquery/1.10.1/jquery.min.js"&gt;&lt;/script&gt;
   &lt;script&gt;
     /* the url root is useful for doing HTTP requests */
     var $URL_ROOT = {{ request.url_root|tojson }};
     /* we store the current user here so that the persona
        javascript support knows about the current user */
     var $CURRENT_USER = {{ g.user|tojson }};
   &lt;/script&gt;
   &lt;script src="{{ url_for('static', filename='js/persona.js') }}"&gt;&lt;/script&gt;
   &lt;link rel="stylesheet" href="{{ url_for('static', filename='css/style.css') }}"&gt;  

   &lt;header&gt;
      &lt;h1&gt;SweetSai &lt;/h1&gt;
      &lt;div class="authbar"&gt;
        {% if g.user %}
          Signed in as &lt;em&gt;{{ g.user }}&lt;/em&gt;
          (&lt;a href="#" class="signout"&gt;Sign out&lt;/a&gt;)
        {% else %}
          Not signed in. &lt;a href="#" class="signin"&gt;Sign in&lt;/a&gt;
        {% endif %}
      &lt;/div&gt;
   &lt;/header&gt;

   &lt;body&gt;
     &lt;div class="container"&gt;
     {% block body %}{% endblock %}
     &lt;/div&gt;
     &lt;script src="http://code.jquery.com/jquery-1.10.2.min.js"&gt;&lt;/script&gt;
     &lt;script src="http://netdna.bootstrapcdn.com/bootstrap/3.0.0/js/bootstrap.min.js"&gt;&lt;/script&gt;
   &lt;/body&gt;

&lt;/html&gt;
</pre>


<p>
Here is the html content for launching the nav bar
</p>


<pre class="example">    &lt;meta name="viewport" content="width=device-width, initial-scale=1.0"&gt;
    &lt;link href="http://netdna.bootstrapcdn.com/bootstrap/3.0.0/css/bootstrap.min.css" rel="stylesheet" media="screen"&gt;
    &lt;style type="text/css"&gt;
      .container {
        max-width: 900px;
        padding-top: 10px;
      }
      h2 {color: red;}
    &lt;/style&gt;

    &lt;!-- will use nav-link macro to highlight the one that we are on --&gt;
    {% from "NavMacro.html" import nav_link with context %}

 &lt;nav class="navbar navbar-inverse" role="navigation"&gt;
  &lt;div class="container-fluid"&gt;
    &lt;div class="navbar-header"&gt;
      &lt;button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1"&gt;
        &lt;span class="sr-only"&gt;Toggle navigation&lt;/span&gt;
        &lt;span class="icon-bar"&gt;&lt;/span&gt;
        &lt;span class="icon-bar"&gt;&lt;/span&gt;
        &lt;span class="icon-bar"&gt;&lt;/span&gt;
      &lt;/button&gt;
      &lt;a class="navbar-brand" href="/index"&gt;Home&lt;/a&gt;
    &lt;/div&gt;

    &lt;div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1"&gt;
      &lt;ul class="nav navbar-nav"&gt;
        &lt;li class="active"&gt;&lt;a href="/login"&gt;Login&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href="/editor"&gt;Editor&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href="/showPg"&gt;ShowPg&lt;/a&gt;&lt;/li&gt;
        &lt;li&gt;&lt;a href="/showall"&gt;Showall &lt;/a&gt;&lt;/li&gt;
      &lt;/ul&gt;

      &lt;!-- search mechanism
      &lt;form class="navbar-form navbar-left" role="search"&gt;
        &lt;div class="form-group"&gt;
          &lt;input type="text" class="form-control" placeholder="Search"&gt;
        &lt;/div&gt;
        &lt;button type="submit" class="btn btn-default"&gt;Submit&lt;/button&gt;
      &lt;/form&gt;
      //--&gt;

      &lt;ul class="nav navbar-nav navbar-right"&gt;
        &lt;li&gt;&lt;a href="#"&gt;DefineSweet&lt;/a&gt;&lt;/li&gt;
        &lt;li class="dropdown"&gt;
          &lt;a href="#" class="dropdown-toggle" data-toggle="dropdown"&gt;User&lt;b class="caret"&gt;&lt;/b&gt;&lt;/a&gt;
          &lt;ul class="dropdown-menu"&gt;
            &lt;li&gt;&lt;a href="/login"&gt;Login&lt;/a&gt;&lt;/li&gt;
            &lt;li&gt;&lt;a href="#"&gt;About&lt;/a&gt;&lt;/li&gt;
            &lt;li&gt;&lt;a href="#"&gt;Action 1&lt;/a&gt;&lt;/li&gt;
            &lt;li&gt;&lt;a href="#"&gt;Action 2&lt;/a&gt;&lt;/li&gt;
            &lt;li class="divider"&gt;&lt;/li&gt;
            &lt;li&gt;&lt;a href="/logout"&gt;Signout&lt;/a&gt;&lt;/li&gt;
          &lt;/ul&gt;
        &lt;/li&gt;
      &lt;/ul&gt;
    &lt;/div&gt;&lt;!-- /.navbar-collapse --&gt;
  &lt;/div&gt;&lt;!-- /.container-fluid --&gt;
&lt;/nav&gt;
</pre>


<p>
Here is the macro I use to ensure that my navigator bar highlights the
page that I am actively on.
</p>


<pre class="example">{% macro nav_link(endpoint, name) %}
{% if request.endpoint.endswith(endpoint) %}
  &lt;li class="active"&gt;&lt;a href="{{ url_for(endpoint) }}"&gt;{{name}}&lt;/a&gt;&lt;/li&gt;
{% else %}
  &lt;li&gt;&lt;a href="{{ url_for(endpoint) }}"&gt;{{name}}&lt;/a&gt;&lt;/li&gt;
{% endif %}
{% endmacro %}
</pre>


<p>
Here is the content for dealing with Mozilla's Persona based
authentication
</p>


<pre class="example">&lt;meta http-equiv="X-UA-Compatible" content="IE=Edge"&gt;
&lt;script src="{{ config.PERSONA_JS }}"&gt;&lt;/script&gt;
&lt;script src="//ajax.googleapis.com/ajax/libs/jquery/1.10.1/jquery.min.js"&gt;&lt;/script&gt;
&lt;script&gt;
  /* the url root is useful for doing HTTP requests */
  var $URL_ROOT = {{ request.url_root|tojson }};
  /* we store the current user here so that the persona
     javascript support knows about the current user */
  var $CURRENT_USER = {{ g.user|tojson }};
&lt;/script&gt;
&lt;script src="{{ url_for('static', filename='js/persona.js') }}"&gt;&lt;/script&gt;
&lt;link rel="stylesheet" href="{{ url_for('static', filename='css/style.css') }}"&gt;  
</pre>


<p> 
Here is code for indicating the status of user authentication 
</p>


<pre class="example">&lt;div class="authbar"&gt;
  {% if g.user %}
    Signed in as &lt;em&gt;{{ g.user }}&lt;/em&gt;
    (&lt;a href="#" class="signout"&gt;Sign out&lt;/a&gt;)
  {% else %}
    Not signed in. &lt;a href="#" class="signin"&gt;Sign in&lt;/a&gt;
  {% endif %}
&lt;/div&gt;
</pre>


</div>

</div>
