SweetSai.html

<div id="outline-container-7-4-2" class="outline-4">
<h4 id="sec-7-4-2"><span class="section-number-4">7.4.2</span> navigation bar template</h4>
<div class="outline-text-4" id="text-7-4-2">




<pre class="example">{% extends "coreLayout.html" %}
{% set active_page = "index" %}

{% set navigation_bar = [
   ('/', 'index', 'Index'),
   ('/login/', 'login, 'Login'),
   ('/logout/', 'logout', 'Logout),
   ('/inputurl/', 'inputurl', 'InputURL')
] -%}
{% set active_page = active_page | default('index') -%}

&lt;ul id="navigation"&gt;
   {% for href, id, caption in navigation_bar %}
      &lt;li {% if id == active_page %} class="active" 
          {% endif %}&gt;&lt;a href="{{ href|e }}"&gt;{{ caption|e }}&lt;/a&gt;&lt;/li&gt;
   {% endfor %}
&lt;/ul&gt;
</pre>

</div>

</div>

<div id="outline-container-7-4-3" class="outline-4">
<h4 id="sec-7-4-3"><span class="section-number-4">7.4.3</span> how I intend to show sweets</h4>
<div class="outline-text-4" id="text-7-4-3">

<p>Here is the template on which I will show the Sweets. Pls note that
it is enhancing the core or base template. 
</p>



<pre class="example">{% extends "coreLayout.html" %}
{% block body %}
  &lt;ul class=entries&gt;
  &lt;p&gt; Here is the Raw Sweet Array: {{ sweet_array }} &lt;/p&gt;
  &lt;h2&gt; here are your sweets: &lt;/h2&gt;
  {% for swt in sweet_array %}
     &lt;ul&gt; ID: {{ swt.id }} &lt;/ul&gt;
     &lt;ul&gt; Who: {{ swt.who }} &lt;/ul&gt;
     &lt;ul&gt; Context ID: {{ swt.context_id }} &lt;/ul&gt;
     &lt;ul&gt; What: {{ swt.what }} &lt;/ul&gt;
     &lt;ul&gt; Where: {{ swt.where }} &lt;/ul&gt;
     &lt;br&gt;
  {% else %}
    &lt;li&gt;&lt;em&gt;Unbelievable. No Sweets here so far!&lt;/em&gt;
  {% endfor %}
  &lt;/ul&gt;
{% endblock %}
</pre>


</div>

</div>

<div id="outline-container-7-4-4" class="outline-4">
<h4 id="sec-7-4-4"><span class="section-number-4">7.4.4</span> my page for getting Sweet User ID</h4>
<div class="outline-text-4" id="text-7-4-4">

<p>Authentication of the user is done by Mozilla Firefox Persona
utility. Here I am registering the ID that user may want to use for
composing Sweets. 
</p>


<pre class="example">&lt;!-- extend from base coreLayout.html --&gt;
{% extends "coreLayout.html" %}

{% block body %}
&lt;form action="" method="post" name="login"&gt;
     {{ form.hidden_tag() }}
     &lt;p&gt; Please enter your Sweet ID: &lt;br&gt;
         {{ form.usr_name(size=10) }}&lt;br&gt;
     &lt;/p&gt;

     &lt;p&gt;{{ form.remember_me }} Remember Me &lt;/p&gt;

     &lt;p&gt;&lt;input type="submit" value="Sign In"&gt;&lt;/p&gt;
&lt;/form&gt;
{% endblock %}
</pre>


</div>

</div>

<div id="outline-container-7-4-5" class="outline-4">
<h4 id="sec-7-4-5"><span class="section-number-4">7.4.5</span> Submit page</h4>
<div class="outline-text-4" id="text-7-4-5">

<p>Here is my submit page in HTML
</p>


<pre class="example">&lt;!--extend from base coreLayout.html --&gt;
{% extends "coreLayout.html" %}

{% block body %}
&lt;form method="POST" action="/"&gt;
    {{ form.hidden_tag }}
    {{ form.usr_name.label }} {{ form.usr_name(size=20) }}
    &lt;input type="submit" value="Go"&gt;
&lt;/form&gt;
{% endblock %}
</pre>


</div>

</div>

<div id="outline-container-7-4-6" class="outline-4">
<h4 id="sec-7-4-6"><span class="section-number-4">7.4.6</span> success page</h4>
<div class="outline-text-4" id="text-7-4-6">

</div>

</div>

<div id="outline-container-7-4-7" class="outline-4">
<h4 id="sec-7-4-7"><span class="section-number-4">7.4.7</span> Here is my success page in HTML</h4>
<div class="outline-text-4" id="text-7-4-7">




<pre class="example">&lt;!-- extend from base coreLayout.html --&gt;
{% extends "coreLayout.html" %}

{% block body %}
&lt;h1&gt;SweetSai Success page &lt;/h1&gt;
{% endblock %}
</pre>


</div>

</div>

<div id="outline-container-7-4-8" class="outline-4">
<h4 id="sec-7-4-8"><span class="section-number-4">7.4.8</span> my logout page</h4>
<div class="outline-text-4" id="text-7-4-8">

<p>Here is the code for my logout page<a name="sources" class="target">sources</a> 
</p>


<pre class="example">&lt;!-- extend from base coreLayout.html --&gt;
{% extends "coreLayout.html" %}

{% block body %}
&lt;h1&gt; this is the logOUT page &lt;/h1&gt;
{% endblock %}
</pre>


</div>

</div>

<div id="outline-container-7-4-9" class="outline-4">
<h4 id="sec-7-4-9"><span class="section-number-4">7.4.9</span> my LoginForm page</h4>
<div class="outline-text-4" id="text-7-4-9">




<pre class="example">&lt;!-- extend from base coreLayout.html --&gt;
{% extends "coreLayout.html" %}

{% block body %}
&lt;form action="" method="post" name="login"&gt;
     {{ form.hidden_tag() }}
     &lt;p&gt; Please enter your Sweet ID: &lt;br&gt;
         {{ form.usr_name(size=10) }}&lt;br&gt;
     &lt;/p&gt;

     &lt;p&gt;{{ form.remember_me }} Remember Me &lt;/p&gt;

     &lt;p&gt;&lt;input type="submit" value="Sign In"&gt;&lt;/p&gt;
&lt;/form&gt;
{% endblock %}
</pre>


</div>

</div>

<div id="outline-container-7-4-10" class="outline-4">
<h4 id="sec-7-4-10"><span class="section-number-4">7.4.10</span> style.css file</h4>
<div class="outline-text-4" id="text-7-4-10">

<p>Here is the style sheet that I use for my Mozilla Persona authorization
</p>


<pre class="example">
html {
    background: #eee;
}

body {
    font-family: 'Verdana', sans-serif;
    font-size: 15px;
    margin: 30px auto;
    width: 720px;
    background: white;
    padding: 30px;
}

h1 {
    margin: 0;
}

h1, h2, a {
    color: #d00;
}

div.authbar {
    background: #eee;
    padding: 0 15px;
    margin: 10px -15px;
    line-height: 25px;
    height: 25px;
    vertical-align: middle;
}

div.signinprogress {
    position: fixed;
    top: 0;
    left: 0;
    right: 0;
    bottom: 0;
    background: rgba(255, 255, 255, 0.8) url(spinner.png) center center no-repeat;
    font-size: 0;
}
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Client-side or Front-End Development work</h2>
<div class="outline-text-2" id="text-8">

<p>The front-end development work is being done using Angular JS
framework. It is being written in JavaScript. The page that is being
displayed, or the page which triggers the JavaScript is a HTML page.
</p>
<p>
The coding details of these two are discussed below.
</p>

</div>
