SweetSai.tex
\subsubsection{navigation bar template}
\label{sec-7-4-2}


\begin{verbatim}
{% extends "coreLayout.html" %}
{% set active_page = "index" %}

{% set navigation_bar = [
   ('/', 'index', 'Index'),
   ('/login/', 'login, 'Login'),
   ('/logout/', 'logout', 'Logout),
   ('/inputurl/', 'inputurl', 'InputURL')
] -%}
{% set active_page = active_page | default('index') -%}

<ul id="navigation">
   {% for href, id, caption in navigation_bar %}
      <li {% if id == active_page %} class="active" 
          {% endif %}><a href="{{ href|e }}">{{ caption|e }}</a></li>
   {% endfor %}
</ul>
\end{verbatim}
\subsubsection{how I intend to show sweets}
\label{sec-7-4-3}

Here is the template on which I will show the Sweets. Pls note that
it is enhancing the core or base template. 


\begin{verbatim}
{% extends "coreLayout.html" %}
{% block body %}
  <ul class=entries>
  <p> Here is the Raw Sweet Array: {{ sweet_array }} </p>
  <h2> here are your sweets: </h2>
  {% for swt in sweet_array %}
     <ul> ID: {{ swt.id }} </ul>
     <ul> Who: {{ swt.who }} </ul>
     <ul> Context ID: {{ swt.context_id }} </ul>
     <ul> What: {{ swt.what }} </ul>
     <ul> Where: {{ swt.where }} </ul>
     <br>
  {% else %}
    <li><em>Unbelievable. No Sweets here so far!</em>
  {% endfor %}
  </ul>
{% endblock %}
\end{verbatim}
\subsubsection{my page for getting Sweet User ID}
\label{sec-7-4-4}

Authentication of the user is done by Mozilla Firefox Persona
utility. Here I am registering the ID that user may want to use for
composing Sweets. 

\begin{verbatim}
<!-- extend from base coreLayout.html -->
{% extends "coreLayout.html" %}

{% block body %}
<form action="" method="post" name="login">
     {{ form.hidden_tag() }}
     <p> Please enter your Sweet ID: <br>
         {{ form.usr_name(size=10) }}<br>
     </p>

     <p>{{ form.remember_me }} Remember Me </p>

     <p><input type="submit" value="Sign In"></p>
</form>
{% endblock %}
\end{verbatim}
\subsubsection{Submit page}
\label{sec-7-4-5}

Here is my submit page in HTML

\begin{verbatim}
<!--extend from base coreLayout.html -->
{% extends "coreLayout.html" %}

{% block body %}
<form method="POST" action="/">
    {{ form.hidden_tag }}
    {{ form.usr_name.label }} {{ form.usr_name(size=20) }}
    <input type="submit" value="Go">
</form>
{% endblock %}
\end{verbatim}
\subsubsection{success page}
\label{sec-7-4-6}
\subsubsection{Here is my success page in HTML}
\label{sec-7-4-7}


\begin{verbatim}
<!-- extend from base coreLayout.html -->
{% extends "coreLayout.html" %}

{% block body %}
<h1>SweetSai Success page </h1>
{% endblock %}
\end{verbatim}
\subsubsection{my logout page}
\label{sec-7-4-8}

Here is the code for my logout page\label{sources}sources 

\begin{verbatim}
<!-- extend from base coreLayout.html -->
{% extends "coreLayout.html" %}

{% block body %}
<h1> this is the logOUT page </h1>
{% endblock %}
\end{verbatim}
\subsubsection{my LoginForm page}
\label{sec-7-4-9}


\begin{verbatim}
<!-- extend from base coreLayout.html -->
{% extends "coreLayout.html" %}

{% block body %}
<form action="" method="post" name="login">
     {{ form.hidden_tag() }}
     <p> Please enter your Sweet ID: <br>
         {{ form.usr_name(size=10) }}<br>
     </p>

     <p>{{ form.remember_me }} Remember Me </p>

     <p><input type="submit" value="Sign In"></p>
</form>
{% endblock %}
\end{verbatim}
\subsubsection{style.css file}
\label{sec-7-4-10}

Here is the style sheet that I use for my Mozilla Persona authorization

\begin{verbatim}

html {
    background: #eee;
}

body {
    font-family: 'Verdana', sans-serif;
    font-size: 15px;
    margin: 30px auto;
    width: 720px;
    background: white;
    padding: 30px;
}

h1 {
    margin: 0;
}

h1, h2, a {
    color: #d00;
}

div.authbar {
    background: #eee;
    padding: 0 15px;
    margin: 10px -15px;
    line-height: 25px;
    height: 25px;
    vertical-align: middle;
}

div.signinprogress {
    position: fixed;
    top: 0;
    left: 0;
    right: 0;
    bottom: 0;
    background: rgba(255, 255, 255, 0.8) url(spinner.png) center center no-repeat;
    font-size: 0;
}
\end{verbatim}
\section{Client-side or Front-End Development work}
\label{sec-8}

The front-end development work is being done using Angular JS
framework. It is being written in JavaScript. The page that is being
displayed, or the page which triggers the JavaScript is a HTML page.

The coding details of these two are discussed below.
