SweetSai.html

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> JavaScript code for front-end</h3>
<div class="outline-text-3" id="text-8-1">

<p>Here is the code for the basic Angular JS APP component
</p>


<pre class="example">var app = angular.module('GetPage', []);

</pre>


<p>
This is the JavaScript code for the controller for the Angular JS app that I have created.
</p>


<pre class="example">
//exposing expose variables and functionality to expressions and directives in Template
app.controller('GetPageController', function ($scope, $http) { 
        $scope.inputURL = "http://teststore.swtr.us/";
        $scope.show = function() {
                var returnPromise = $http.get($scope.inputURL);
                returnPromise.then(
                    //success
                    function(data, status, headers, config) {
                           console.log("Server responded: Success in getting: ", $scope.inputURL);      
                           $scope.expression = data;
                           },
                        //error   
                    function(data, status, headers, config) {
               log($scope.inputURL);            
                           console.log("Server responded: Error in getting: ", $scope.inputURL);
                           },
                        //progress   
                        function(data, status, headers, config) {
                           console.log("Server responded: Progress in getting: ", $scope.inputURL);     
                           });
                log($scope.inputURL);      
                console.log("I created an Asynch call and am exiting the Show() function");     
                };
        });
</pre>


<p>
This function is used for logging debug messages directly to the HTML
page on the browser. 
</p>


<pre class="example">function log(str){
  var log = document.getElementById("log")
  if (log){ 
         // let's be safe...
     log.innerHTML += str + "&lt;br/&gt;";
     }
};
</pre>



</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> HTML code for front-end</h3>
<div class="outline-text-3" id="text-8-2">

<p>Here is the HTML page that gets loaded to get / show Sweets.
</p>


<pre class="example">&lt;!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" 
 "http://www.w3.org/TR/html4/strict.dtd"&gt;
&lt;html&gt;
   &lt;head&gt;
      &lt;link href="//fonts.googleapis.com/css?family=Roboto:100,300"
            rel="stylesheet" type="text/css" /&gt;
      &lt;link rel="stylesheet" href={{ url_for('static', filename='css/SwtFrntStyle.css') }} /&gt;
   &lt;/head&gt;

   &lt;body data-ng-app="GetPage"&gt;
      &lt;div class="page-container" id="log" data-ng-controller="GetPageController"&gt;
         &lt;h2&gt; SaiGo's Sweet Page &lt;/h2&gt;
         &lt;div&gt; 
            input URL: &lt;input type="url" data-ng-model="inputURL" required&gt;
            &lt;button class="btn" data-ng-click="show()"&gt;Show&lt;/button&gt;
         &lt;/div&gt;
         &lt;div data-ng-bind-html-unsafe="expression"&gt; &lt;/div&gt;
      &lt;/div&gt;    
      &lt;script src="http://ajax.googleapis.com/ajax/libs/angularjs/1.3.14/angular.min.js"&gt; &lt;/script&gt;
      &lt;script src={{ url_for('static', filename='js/SwtFrntApp.js')   }}&gt;&lt;/script&gt;
      &lt;script src={{ url_for('static', filename='js/SwtFrntCntrl.js') }}&gt;&lt;/script&gt;
      &lt;script src={{ url_for('static', filename='js/SwtFrntLog.js')   }}&gt;&lt;/script&gt;
   &lt;/body&gt;

&lt;/html&gt;
</pre>


<p>
Here is the CSS file for the front end tool we are developing.
</p>


<pre class="example">* {
  box-sizing: border-box;
  font-family: 'Roboto', Arial;
  color: #95e2aa;
}

html, body {
  height: 100%;
  width: 100%;
}

body {
  background-attachment: scroll;
  background-clip: border-box;
  background-color: rgba(0, 0, 0, 0);
  background-image: url(http://subtlepatterns.com/patterns/stardust.png);
  background-origin: padding-box;
  background-size: auto;
}

.rebel {
  color: #ff6450;
}

.achieve {
  color: #9dc9a8;
}

.bt {
  width: 40px;
  border: none;
  cursor: pointer;
  outline: none;
}

.bt.bt-rebel {
  background: #ff6450;
  color: #fff;
}

.bt.bt-achieve {
  background: #9dc9a8;
  color: #444349;
}

.txt {
  background: transparent;
  width: 100%;
  outline: none;
  padding: 10px;
  margin: 4px 0;
  border: 1px solid #9dc9a8;
  width: 90%;
  font-size: 16px;
  position: relative;
  min-height: 100%;
}

.page-container {
  width: 90%;
  margin: 0 auto;
}

.page-container h2 {
  text-align: center;
  font-weight: 900;
}

.add-todo .txt {
  padding: 10px;
}

.todo-list, .add-todo {
  list-style-type: none;
  text-align: left;
}

.todo-list li {
  padding: 10px 80px 10px 10px;
  margin: 4px 0;
  border: 1px solid #9dc9a8;
  width: 90%;
  position: relative;
  min-height: 100%;
  cursor: pointer;
}

.todo-list li .bt {
  position: absolute;
  right: 0;
  top: 0;
  height: 100%;
  transition: width 0.4s ease-in-out;
}

.todo-list li .bt:hover {
  width: 80px;
}
</pre>



</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> clipboard</h2>
<div class="outline-text-2" id="text-9">











</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2016-03-02T15:05+0530</p>
<p class="author">Author: Sai Gollapudi</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
