SweetSai.tex
\subsection{JavaScript code for front-end}
\label{sec-8-1}

Here is the code for the basic Angular JS APP component

\begin{verbatim}
var app = angular.module('GetPage', []);
\end{verbatim}

This is the JavaScript code for the controller for the Angular JS app that I have created.

\begin{verbatim}

//exposing expose variables and functionality to expressions and directives in Template
app.controller('GetPageController', function ($scope, $http) { 
        $scope.inputURL = "http://teststore.swtr.us/";
        $scope.show = function() {
                var returnPromise = $http.get($scope.inputURL);
                returnPromise.then(
                    //success
                    function(data, status, headers, config) {
                           console.log("Server responded: Success in getting: ", $scope.inputURL);      
                           $scope.expression = data;
                           },
                        //error   
                    function(data, status, headers, config) {
               log($scope.inputURL);            
                           console.log("Server responded: Error in getting: ", $scope.inputURL);
                           },
                        //progress   
                        function(data, status, headers, config) {
                           console.log("Server responded: Progress in getting: ", $scope.inputURL);     
                           });
                log($scope.inputURL);      
                console.log("I created an Asynch call and am exiting the Show() function");     
                };
        });
\end{verbatim}

This function is used for logging debug messages directly to the HTML
page on the browser. 

\begin{verbatim}
function log(str){
  var log = document.getElementById("log")
  if (log){ 
         // let's be safe...
     log.innerHTML += str + "<br/>";
     }
};
\end{verbatim}
\subsection{HTML code for front-end}
\label{sec-8-2}

Here is the HTML page that gets loaded to get / show Sweets.

\begin{verbatim}
<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" 
 "http://www.w3.org/TR/html4/strict.dtd">
<html>
   <head>
      <link href="//fonts.googleapis.com/css?family=Roboto:100,300"
            rel="stylesheet" type="text/css" />
      <link rel="stylesheet" href={{ url_for('static', filename='css/SwtFrntStyle.css') }} />
   </head>

   <body data-ng-app="GetPage">
      <div class="page-container" id="log" data-ng-controller="GetPageController">
         <h2> SaiGo's Sweet Page </h2>
         <div> 
            input URL: <input type="url" data-ng-model="inputURL" required>
            <button class="btn" data-ng-click="show()">Show</button>
         </div>
         <div data-ng-bind-html-unsafe="expression"> </div>
      </div>    
      <script src="http://ajax.googleapis.com/ajax/libs/angularjs/1.3.14/angular.min.js"> </script>
      <script src={{ url_for('static', filename='js/SwtFrntApp.js')   }}></script>
      <script src={{ url_for('static', filename='js/SwtFrntCntrl.js') }}></script>
      <script src={{ url_for('static', filename='js/SwtFrntLog.js')   }}></script>
   </body>

</html>
\end{verbatim}

Here is the CSS file for the front end tool we are developing.

\begin{verbatim}
* {
  box-sizing: border-box;
  font-family: 'Roboto', Arial;
  color: #95e2aa;
}

html, body {
  height: 100%;
  width: 100%;
}

body {
  background-attachment: scroll;
  background-clip: border-box;
  background-color: rgba(0, 0, 0, 0);
  background-image: url(http://subtlepatterns.com/patterns/stardust.png);
  background-origin: padding-box;
  background-size: auto;
}

.rebel {
  color: #ff6450;
}

.achieve {
  color: #9dc9a8;
}

.bt {
  width: 40px;
  border: none;
  cursor: pointer;
  outline: none;
}

.bt.bt-rebel {
  background: #ff6450;
  color: #fff;
}

.bt.bt-achieve {
  background: #9dc9a8;
  color: #444349;
}

.txt {
  background: transparent;
  width: 100%;
  outline: none;
  padding: 10px;
  margin: 4px 0;
  border: 1px solid #9dc9a8;
  width: 90%;
  font-size: 16px;
  position: relative;
  min-height: 100%;
}

.page-container {
  width: 90%;
  margin: 0 auto;
}

.page-container h2 {
  text-align: center;
  font-weight: 900;
}

.add-todo .txt {
  padding: 10px;
}

.todo-list, .add-todo {
  list-style-type: none;
  text-align: left;
}

.todo-list li {
  padding: 10px 80px 10px 10px;
  margin: 4px 0;
  border: 1px solid #9dc9a8;
  width: 90%;
  position: relative;
  min-height: 100%;
  cursor: pointer;
}

.todo-list li .bt {
  position: absolute;
  right: 0;
  top: 0;
  height: 100%;
  transition: width 0.4s ease-in-out;
}

.todo-list li .bt:hover {
  width: 80px;
}
\end{verbatim}
\section{clipboard}
\label{sec-9}

\end{document}
